modules/about/data/README.md
```mermaid
graph TD
aboutdata["about:data"]
apigithub["api:github"]
codegenannotation["codegen:annotation"]
coremodel["core:model"]
style aboutdata fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style apigithub fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style codegenannotation fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
style coremodel fill:#9D8DF1,stroke:#333,stroke-width:2px,color:black,font-weight:bold
aboutdata --> apigithub
apigithub -.-> codegenannotation
apigithub --> coremodel
```
