modules/about/data/modules.dot
digraph {
edge ["dir"="forward"]
graph ["dpi"="100","label"=":about:data","labelloc"="t","fontsize"="30","ranksep"="1.5","rankdir"="TB"]
node ["style"="filled"]
":about:data" ["fillcolor"="#9D8DF1","color"="black","penwidth"="3","shape"="box"]
":api:github" ["fillcolor"="#9D8DF1","shape"="none"]
":codegen:annotation" ["fillcolor"="#9D8DF1","shape"="none"]
":core:model" ["fillcolor"="#9D8DF1","shape"="none"]
{
edge ["dir"="none"]
graph ["rank"="same"]
":about:data"
}
":about:data" -> ":api:github"
":api:github" -> ":codegen:annotation" ["style"="dotted"]
":api:github" -> ":core:model"
}
